# Titanic EDA

seaborn 내장 데이터 `titanic`으로 `pandas` 연습하기

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
# (행의 수, 열의 수)
df.shape

(891, 15)

In [3]:
# 결측치 수
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [4]:
# 타깃값('alive')의 빈도수
df['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [5]:
# 수치형 컬럼의 통계량
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
# object 타입 컬럼의 통계량
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [7]:
# 소문자로 변경
embark_lower = df['embark_town'].str.lower()
embark_lower.head()

0    southampton
1      cherbourg
2    southampton
3    southampton
4    southampton
Name: embark_town, dtype: object

In [8]:
# 'embark_lower'에서 south가 들어가는 데이터 수
embark_lower.str.contains('south').sum()

644

In [9]:
# 파생변수 'child' 생성 - 15세 이하
df['child'] = (df['age'] <= 15)
df['child']

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: child, Length: 891, dtype: bool

In [10]:
# 'child' 컬럼에서 각 값들의 빈도수
df['child'].value_counts()

# df.groupby('child').size()  # 이렇게 해도 되긴 함

False    808
True      83
Name: child, dtype: int64

In [11]:
# 'embarked'가 'C'고, 'pclass'가 3인 데이터만 추출
df2 = df[(df['embarked'] == 'C') & (df['pclass'] == 3)]
df2[['embarked', 'pclass']]

    embarked  pclass
19         C       3
26         C       3
36         C       3
39         C       3
42         C       3
..       ...     ...
847        C       3
852        C       3
858        C       3
859        C       3
875        C       3

[66 rows x 2 columns]

In [12]:
# 'fare'가 500을 넘는 데이터만 추출
df[df['fare'] > 500]['fare']

258    512.3292
679    512.3292
737    512.3292
Name: fare, dtype: float64

In [13]:
# 원하는 데이터만 추출 후, 특정 컬럼의 평균(mean) 구하기
df[(df['pclass'] == 3) & (df['embarked'] == 'Q')]['fare'].mean()

11.183393055555557

In [14]:
# 원하는 데이터만 추출 후, grouby로 특정 컬럼에서 각 값들의 개수(count) 구하기
df[df['fare'] > 50].groupby('class')['class'].count()

# df.loc[df['fare'] > 50, 'class'].value_counts()  # 그냥 이렇게 해도 됨

class
First     139
Second      7
Third      14
Name: class, dtype: int64

In [15]:
# 원하는 데이터만 추출 후, .shape 확인
df[(df['fare'] >= 10) & (df['fare'] <= 50)].shape

(395, 16)

In [16]:
# df['age'] 결측치 채워서 다른 컬럼에 담기
df['age_fill'] = df['age'].fillna(0)

In [17]:
print(df['age'].mean())
print(df['age_fill'].mean())

29.69911764705882
23.79929292929293

모든 기술통계값은 NaN값을 제외한 후 산출된다.

In [18]:
# 'dect' 별로 그룹화 해서 개수 세고(count), A~G 순으로 정렬
df.groupby('deck')['deck'].count().sort_index()

# df['deck'].value_counts().sort_index()  # 그냥 이렇게 해도 됨

deck
A    15
B    47
C    59
D    33
E    32
F    13
G     4
Name: deck, dtype: int64

In [19]:
# 원하는 데이터만 추출 후, 특정 컬럼의 중앙값(median) 구하기
df[df['pclass'] == 1]['fare'].median()

60.287499999999994

In [20]:
# 원하는 데이터만 추출 후, 특정 컬럼의 평균(mean) 구하기
df[(df['embarked'] == 'C') | (df['deck'] == 'F')]['age'].mean()

29.967517730496454

In [21]:
# 원하는 데이터만 추출 후, shape 확인
df[(df['alive'] == 'yes') & (df['alone'] == True)].shape

(163, 17)

In [22]:
# 특정 컬럼에서 상위 10개 보기
# 내림차순 정렬 후, 위에 열 개만 뽑으면 됨
df['age'].sort_values(ascending=False).head(10)

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
672    70.0
745    70.0
33     66.0
54     65.0
280    65.0
Name: age, dtype: float64